VinhLin/STM32F103/PT100_Max31865/Itracking_BoardMax31865/PT100_Max31865/Src/main.c
/**
  ******************************************************************************
  * File Name          : main.c
  * Description        : Main program body
  ******************************************************************************
  ** This notice applies to any and all portions of this file
  * that are not between comment pairs USER CODE BEGIN and
  * USER CODE END. Other portions of this file, whether 
  * inserted by the user or by software development tools
  * are owned by their respective copyright owners.
  *
  * COPYRIGHT(c) 2019 STMicroelectronics
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32f1xx_hal.h"

/* USER CODE BEGIN Includes */
#include <dbgPrint.h>
#include <MAX31865.h>
#include <ChecksumXOR.h>
#include <stringlib.h>
#include <macro.h>

#include "stdlib.h"
#include "stdio.h"
#include "string.h"
#include "math.h"
/* USER CODE END Includes */

/* Private variables ---------------------------------------------------------*/
SPI_HandleTypeDef hspi1;

UART_HandleTypeDef huart2;

/* USER CODE BEGIN PV */
/* Private variables ---------------------------------------------------------*/
struct TEMP
{
	uint8_t readData[128];
	uint8_t checksum[2];
	char Convert[50];
} A;
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_SPI1_Init(void);
static void MX_USART2_UART_Init(void);

/* USER CODE BEGIN PFP */
/* Private function prototypes -----------------------------------------------*/

/* USER CODE END PFP */

/* USER CODE BEGIN 0 */
volatile uint8_t proceed_flag = 0;
volatile uint8_t proceed_flag_1 = 0;
uint8_t proceed_flag_2 = 0;
uint8_t proceed_flag_3 = 0;

uint8_t string[] = "ATEMP,";

void printchar (uint8_t c)
{
	HAL_UART_Transmit(&huart2, &c, 1, 1000);
}

//............................/*Functions Document for MAX31865*/.........................
void spi_write(uint8_t *data, uint8_t len)
{
	HAL_SPI_Transmit(&hspi1, data, len, HAL_MAX_DELAY);
}
void spi_read(uint8_t *buffer, uint8_t len)
{
	HAL_SPI_Receive(&hspi1, buffer, len, HAL_MAX_DELAY);
}
void MAX31865_read(uint8_t addr, uint8_t *buffer, uint8_t len)
{
    addr &= ~MAX31865_READ;                                     // Force read bit on address

    HAL_GPIO_WritePin(GPIO_PORT_CS, GPIO_PIN_CS, GPIO_PIN_RESET);          // Enable CE
    spi_write(&addr, 1);                                        // Write addr
    while(HAL_SPI_GetState(&hspi1) != HAL_SPI_STATE_READY);
    spi_read(buffer, len);                                      // Read data
    HAL_GPIO_WritePin(GPIO_PORT_CS, GPIO_PIN_CS, GPIO_PIN_SET);         // Disable CE

}
void MAX31865_write(uint8_t addr, uint8_t data)
{
    addr |= MAX31865_WRITE;                                 // Force write bit on address

    HAL_GPIO_WritePin(GPIO_PORT_CS, GPIO_PIN_CS, GPIO_PIN_RESET);      // Enable CE
    spi_write(&addr, 1);                                    // Write addr
    spi_write(&data, 1);                                    // Write data
    HAL_GPIO_WritePin(GPIO_PORT_CS, GPIO_PIN_CS, GPIO_PIN_SET);     // Disable CE
}

float  temperature(float RTDnominal, float refResistor, float data) {

  float Z1, Z2, Z3, Z4, Rt, temp;

  Rt = data;
  Rt /= 32768;
  Rt *= refResistor;

  Z1 = -RTD_A;
  Z2 = RTD_A * RTD_A - (4 * RTD_B);
  Z3 = (4 * RTD_B) / RTDnominal;
  Z4 = 2 * RTD_B;

  temp = Z2 + (Z3 * Rt);
  temp = (sqrt(temp) + Z1) / Z4;

  if (temp >= 0) return temp;

  // ugh.
  Rt /= RTDnominal;
  Rt *= 100;      // normalize to 100 ohm

  float rpoly = Rt;

  temp = -242.02;
  temp += 2.2228 * rpoly;
  rpoly *= Rt;  // square
  temp += 2.5859e-3 * rpoly;
  rpoly *= Rt;  // ^3
  temp -= 4.8260e-6 * rpoly;
  rpoly *= Rt;  // ^4
  temp -= 2.8183e-8 * rpoly;
  rpoly *= Rt;  // ^5
  temp += 1.5243e-10 * rpoly;

  return temp;
}

float MAX31865_readTemp()
{
	MAX31865_write(0, 0xB2);
	HAL_Delay(100);

    // Read data from max31865 data registers
    uint8_t max3[2];
    MAX31865_read(MAX31856_RTDMSB_REG, max3, 2);

    // Combine 2 bytes into 1 number, and shift 1 down to remove fault bit
    uint32_t data = max3[0] << 8;
    data |= max3[1];
    data >>= 1;
//  DBG_print("data=%02x \r\n",data);

    // Calculate the temperature from the measured resistance
    float temp = temperature(100, 430, (float) data );

    return temp;
}
//......................../*END Functions Document for MAX31865*/.........................

//............................/*Receive Data from Itracking*/..............................
uint8_t rx_index = 0;
uint8_t rx_data;
uint8_t rx_buffer[128] = {0};
//uint8_t version[] = "v1.0 \r\n";

void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart)
{
	if(huart->Instance == USART2)
	{
		rx_buffer[rx_index++] = rx_data;
		if (rx_data == '\r') {
			proceed_flag_1 = 1;
		}
	}
	HAL_UART_Receive_IT(&huart2, &rx_data, 1);
}

/* USER CODE END 0 */

int main(void)
{

  /* USER CODE BEGIN 1 */
	uint8_t count = 0, index = 0, dem=0, count1;
	uint32_t Time;
	uint8_t result;

	uint8_t lhs[128];
	uint8_t rhs[50];

	uint32_t Delay = 1000;	//Default 1s

  /* USER CODE END 1 */

  /* MCU Configuration----------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_SPI1_Init();
  MX_USART2_UART_Init();

  /* USER CODE BEGIN 2 */
  DBG_setup(printchar);
  HAL_UART_Receive_IT(&huart2, &rx_data, 1);

  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
	  DBG_print(rx_buffer);
//...................../*Compare Checksum*/.....................
	  if (proceed_flag_1 != 0) {
		  if (result = compareChecksum(rx_buffer) != 0 ) {
			  	DBG_print("Data: %s \r\n", s.data);
				DBG_print(" True Data \r\n");
//				DBG_print("result:%d \r\n",result);
				proceed_flag = 1;
				proceed_flag_2 = 1;
			} else {
				DBG_print("Data: %s \r\n", s.data);
				DBG_print(s.CheckXOR);
				DBG_print(" False Data \r\n");
//				DBG_print("result:%d \r\n",result);
			}
		  proceed_flag_1 = 0;
	  }

  /* USER CODE END WHILE */

  /* USER CODE BEGIN 3 */

//......................../*Handle Receive from Itracking */....................
	  if (proceed_flag_2 != 0) {
		  memset(lhs, 0, 128);
		  memset(rhs, 0, 50);

		  for (uint8_t k=0; k < strlen(rx_buffer); k++)
		  {
				count++;
				if (strncmp(&rx_buffer[k], "ATEMP", 5) == 0) {
					for (uint8_t i=count; rx_buffer[i] != '\n'; i++)
					{
						index ++;
						memcpy(lhs, rx_buffer+(count-1), index);
					}
					break;
				}
			}

	  	for (uint8_t j=1; lhs[j] != 0; j++)
		{
			if (lhs[j] == ',')
			{
				for (uint8_t m=j; lhs[m] != '*'; m++)
				{
					dem++;
				}
				memcpy(rhs, lhs + (j + 1), dem - 1);
				dem = 0;
			}
		}

	  	Time = atol (rhs); //Doi sang kieu so nguyen
		DBG_print("Time=%d \r\n",Time);
		if (Time == 0)
		{
			proceed_flag = 0;
			Delay = 1000;
		} else {
			Delay = Time;
			DBG_print("Delay=%d \r\n",Delay);
		}

		proceed_flag_2 = 0;
		count = 0;
	  }

// ............./* Read Temperature */.....................
	  if (proceed_flag != 0)
	  {
		  float temp = MAX31865_readTemp();
//	 	  DBG_print("temp=%f \r\n",temp);

		  if (temp > 0 && temp < 850) {
			  // Khi do nhiet do trong khoang 0 -> 850 thi sang den Do, tat den Xanh
			  HAL_GPIO_WritePin(GPIOB, GPIO_PIN_8, GPIO_PIN_SET);	//Led Do sang
			  HAL_GPIO_WritePin(GPIOB, GPIO_PIN_9, GPIO_PIN_RESET);	//Led Xanh tat
			  proceed_flag_3 = 1;
//			  DBG_print("$TEMP,%f \r\n",temp);
		  } else if (temp > -200 && temp < 0) {
			  // Khi do nhiet do trong khoang -200 -> 0 thi sang den Xanh, tat den Do
			  HAL_GPIO_WritePin(GPIOB, GPIO_PIN_8, GPIO_PIN_RESET);	//Led Do tat
			  HAL_GPIO_WritePin(GPIOB, GPIO_PIN_9, GPIO_PIN_SET);	//Led Xanh sang
			  proceed_flag_3 = 1;
//			  DBG_print("$TEMP,%f \r\n",temp);
		  } else {
			  // Neu nam ngoai ca 2 truong hop tren thi tat ca 2 den
			  // Hoac khi chua ket noi cam bien thi cung tat ca 2 den
			  HAL_GPIO_WritePin(GPIOB, GPIO_PIN_8, GPIO_PIN_RESET);
			  HAL_GPIO_WritePin(GPIOB, GPIO_PIN_9, GPIO_PIN_RESET);
			  proceed_flag_3 = 0;
		  }

//........................./*Checksum XOR Transmit Data*/.......................
		  if (proceed_flag_3 == 1) {

			  memset(A.readData, 0, 128);
			  memset(A.Convert, 0, 50);
			  memset(A.checksum, 0, 2);
			  //Convert doublue to string
			  SL_double2s(temp, sizeof(A.Convert), A.Convert);
//			  DBG_print("%s \r\n", A.Convert);

			  count1 = strlen(A.Convert);
			  memcpy(string + 6, A.Convert, count1);
			  memcpy(string + count1 + 6, "*\r\n", 3);

//		      DBG_print(string);
			  valueChecksum(string, A.readData, A.checksum);
			  if (A.checksum != 0) {
//			  DBG_print("Result: ");
				 DBG_print("$TEMP,%f*%s \r\n", temp, A.checksum);
			  }
			  proceed_flag_3 = 0;
		  }
	  }

//...................../*Clean buffer*/...................
	  rx_index = 0;
	  memset(rx_buffer, 0, 128);
	  HAL_Delay(Delay);
  }
  /* USER CODE END 3 */

}

/** System Clock Configuration
*/
void SystemClock_Config(void)
{

  RCC_OscInitTypeDef RCC_OscInitStruct;
  RCC_ClkInitTypeDef RCC_ClkInitStruct;

    /**Initializes the CPU, AHB and APB busses clocks 
    */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_ON;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_NONE;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

    /**Initializes the CPU, AHB and APB busses clocks 
    */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_HSE;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_0) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

    /**Configure the Systick interrupt time 
    */
  HAL_SYSTICK_Config(HAL_RCC_GetHCLKFreq()/1000);

    /**Configure the Systick 
    */
  HAL_SYSTICK_CLKSourceConfig(SYSTICK_CLKSOURCE_HCLK);

  /* SysTick_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(SysTick_IRQn, 0, 0);
}

/* SPI1 init function */
static void MX_SPI1_Init(void)
{

  /* SPI1 parameter configuration*/
  hspi1.Instance = SPI1;
  hspi1.Init.Mode = SPI_MODE_MASTER;
  hspi1.Init.Direction = SPI_DIRECTION_2LINES;
  hspi1.Init.DataSize = SPI_DATASIZE_8BIT;
  hspi1.Init.CLKPolarity = SPI_POLARITY_LOW;
  hspi1.Init.CLKPhase = SPI_PHASE_2EDGE;
  hspi1.Init.NSS = SPI_NSS_SOFT;
  hspi1.Init.BaudRatePrescaler = SPI_BAUDRATEPRESCALER_256;
  hspi1.Init.FirstBit = SPI_FIRSTBIT_MSB;
  hspi1.Init.TIMode = SPI_TIMODE_DISABLE;
  hspi1.Init.CRCCalculation = SPI_CRCCALCULATION_DISABLE;
  hspi1.Init.CRCPolynomial = 10;
  if (HAL_SPI_Init(&hspi1) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

}

/* USART2 init function */
static void MX_USART2_UART_Init(void)
{

  huart2.Instance = USART2;
  huart2.Init.BaudRate = 9600;
  huart2.Init.WordLength = UART_WORDLENGTH_8B;
  huart2.Init.StopBits = UART_STOPBITS_1;
  huart2.Init.Parity = UART_PARITY_NONE;
  huart2.Init.Mode = UART_MODE_TX_RX;
  huart2.Init.HwFlowCtl = UART_HWCONTROL_NONE;
  huart2.Init.OverSampling = UART_OVERSAMPLING_16;
  if (HAL_UART_Init(&huart2) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

}

/** Configure pins as 
        * Analog 
        * Input 
        * Output
        * EVENT_OUT
        * EXTI
*/
static void MX_GPIO_Init(void)
{

  GPIO_InitTypeDef GPIO_InitStruct;

  /* GPIO Ports Clock Enable */
  __HAL_RCC_GPIOD_CLK_ENABLE();
  __HAL_RCC_GPIOA_CLK_ENABLE();
  __HAL_RCC_GPIOB_CLK_ENABLE();

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_12, GPIO_PIN_SET);

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(GPIOB, GPIO_PIN_8|GPIO_PIN_9, GPIO_PIN_RESET);

  /*Configure GPIO pin : PA12 */
  GPIO_InitStruct.Pin = GPIO_PIN_12;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

  /*Configure GPIO pins : PB8 PB9 */
  GPIO_InitStruct.Pin = GPIO_PIN_8|GPIO_PIN_9;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

}

/* USER CODE BEGIN 4 */

/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @param  None
  * @retval None
  */
void _Error_Handler(char * file, int line)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  while(1) 
  {
  }
  /* USER CODE END Error_Handler_Debug */ 
}

#ifdef USE_FULL_ASSERT

/**
   * @brief Reports the name of the source file and the source line number
   * where the assert_param error has occurred.
   * @param file: pointer to the source file name
   * @param line: assert_param error line source number
   * @retval None
   */
void assert_failed(uint8_t* file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
    ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */

}

#endif

/**
  * @}
  */ 

/**
  * @}
*/ 

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
